[
  {
    "id": 1,
    "cover": "https://fahadpatwary.github.io/CoursesAPI/Img/One.png",
    "courseName": "Javascript",
    "courseDes": "JavaScript, often abbreviated as JS, is a programming language that conforms to the ECMAScript specification. JavaScript is high-level, often just-in-time compiled, and multi-paradigm.",
    "courseRating": 4.8,
    "enrolled": 65
  },
  {
    "id": 2,
    "cover": "",
    "courseName": "Python",
    "courseDes": "Python is an interpreted high-level general-purpose programming language. Its design philosophy emphasizes code readability with its use of significant indentation. ",
    "courseRating": 4.7,
    "enrolled": 42
  },
  {
    "id": 3,
    "cover": "",
    "courseName": "c/c++",
    "courseDes": "C++ is a general-purpose programming language created by Bjarne Stroustrup as an extension of the C programming language, or \"C with Classes\".",
    "courseRating": 4.9,
    "enrolled": 36
  },
  {
    "id": 4,
    "cover": "",
    "courseName": "R",
    "courseDes": "R is a programming language and free software environment for statistical computing and graphics supported by the R Core Team and the R Foundation for Statistical Computing. ",
    "courseRating": 4.5,
    "enrolled": 29
  },
  {
    "id": 5,
    "cover": "",
    "courseName": "Matlab",
    "courseDes": "MATLAB is a proprietary multi-paradigm programming language and numeric computing environment developed by MathWorks. MATLAB allows matrix manipulations, plotting of functions and data, implementation of algorithms, creation of user interfaces.",
    "courseRating": 4.6,
    "enrolled": 44
  },
  {
    "id": 6,
    "cover": "",
    "courseName": "Ruby",
    "courseDes": "Ruby is an interpreted, high-level, general-purpose programming language. It was designed and developed in the mid-1990s by Yukihiro \"Matz\" Matsumoto in Japan. ",
    "courseRating": 4.3,
    "enrolled": 49
  },
  {
    "id": 7,
    "cover": "",
    "courseName": "Java",
    "courseDes": "Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible.",
    "courseRating": 4.8,
    "enrolled": 47
  },
  {
    "id": 8,
    "cover": "",
    "courseName": "Go",
    "courseDes": "Go is a statically typed, compiled programming language designed at Google by Robert Griesemer, Rob Pike, and Ken Thompson. Go is syntactically similar to C.",
    "courseRating": 4.6,
    "enrolled": 93
  },
  {
    "id": 9,
    "cover": "",
    "courseName": "PHP",
    "courseDes": "PHP is a general-purpose scripting language geared towards web development. It was originally created by Danish-Canadian programmer Rasmus Lerdorf in 1994.",
    "courseRating": 4.9,
    "enrolled": 115
  },
  {
    "id": 10,
    "cover": "",
    "courseName": "Swift",
    "courseDes": "Swift is a general-purpose, multi-paradigm, compiled programming language developed by Apple Inc. and the open-source community. ",
    "courseRating": 4.6,
    "enrolled": 89
  }
]
